# DataFrame and Series: shared methods

### Import Pandas

In [26]:
import pandas as pd

### Read CSV

In [27]:
# DataFrame() MLS Salaries
df_salary = pd.read_csv("mls_salaries.csv")

# Series() Scientific Animal Names
s_names = pd.read_csv('animal_names.csv', usecols=['scientific_name']).squeeze("columns")

### Head Method

In [28]:
# limits output
df_salary.head(10)

,club,last_name,first_name,position,base_salary,guaranteed_compensation
0,ATL,Almiron,Miguel,M,1912500.0,2297000.00
1,ATL,Ambrose,Mikey,D,65625.0,65625.00
2,ATL,Asad,Yamil,M,150000.0,150000.00
3,ATL,Bloom,Mark,D,99225.0,106573.89
4,ATL,Carleton,Andrew,F,65000.0,77400.00
5,ATL,Carmona,Carlos,M,675000.0,725000.00
6,ATL,Garza,Greg,D,150000.0,150000.00
7,ATL,Gonzalez Pirez,Leandro,D,250008.0,285008.00
8,ATL,Goslin,Chris,M,70000.0,74000.00
9,ATL,Gressel,Julian,NaN,75000.0,93750.00

In [29]:
# limits output
s_names.head(3)

0    Cercatetus concinnus
1        Lutra canadensis
2          Alopex lagopus
Name: scientific_name, dtype: object

### Tail Method

In [4]:
# limits output
df_salary.tail()

    club last_name first_name position  base_salary  guaranteed_compensation
610  VAN   Teibert    Russell        M     126500.0                 194000.0
611  VAN  Tornaghi      Paolo       GK      80000.0                  80000.0
612  VAN    Waston    Kendall        D     350000.0                 368125.0
613  NaN       NaN        NaN      NaN          NaN                      NaN
614  VAN  Williams    Sheanon        D     175000.0                 184000.0

In [30]:
# limits output
s_names.tail(3)

997         Upupa epops
998       Ratufa indica
999    Columba palumbus
Name: scientific_name, dtype: object

### `.info()` Method

In [5]:
# does not work on Series
# return the big picture of your DataFrame
# returns row and column indices and non-null counts
# even memory consumption datat at the bottom!
df_salary.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 615 entries, 0 to 614
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   club                     614 non-null    object
 1   last_name                614 non-null    object
 2   first_name               610 non-null    object
 3   position                 604 non-null    object
 4   base_salary              614 non-null    float64
 5   guaranteed_compensation  614 non-null    float64
dtypes: float64(2), object(4)
memory usage: 29.0+ KB

In [31]:
# works but limited
s_names.info()

<class 'pandas.core.series.Series'>
RangeIndex: 1000 entries, 0 to 999
Series name: scientific_name
Non-Null Count  Dtype
--------------  -----
1000 non-null   object
dtypes: object(1)
memory usage: 7.9+ KB

### `.describe()` Method

In [32]:
df_salary.describe()

        base_salary  guaranteed_compensation
count  6.140000e+02             6.140000e+02
mean   2.971730e+05             3.263752e+05
std    6.725839e+05             7.491217e+05
min    5.299992e+04             5.299992e+04
25%    6.563340e+04             7.003035e+04
50%    1.250000e+05             1.350020e+05
75%    2.550000e+05             2.798750e+05
max    6.660000e+06             7.167500e+06

In [33]:
# works but limited
s_names.describe()

count            1000
unique            449
top       unavailable
freq               19
Name: scientific_name, dtype: object

### `.DataFrame()` is also a method

In [8]:
# Series() is also a method
data_lists = [['a',1,1.0], ['b',2,2.0],['c',3,3.0]]
df = pd.DataFrame(data_lists)

In [9]:
df

   0  1    2
0  a  1  1.0
1  b  2  2.0
2  c  3  3.0

In [17]:
data_lists = [['a',1,1.0], ['b',2,2.0],['c',3,3.0]]
df = pd.DataFrame(data_lists, columns=['strings','integers','floats'])
df

  strings  integers  floats
0       a         1     1.0
1       b         2     2.0
2       c         3     3.0

In [39]:
# instead of get_dtype_counts() use dtypes.value_counts()
df.dtypes.value_counts() # for DataFrames âœ…

object     1
int64      1
float64    1
dtype: int64

In [41]:
# returns AttributeError: 'numpy.dtype[object_]' object has no attribute 'value_counts'
s_names.dtypes.value_counts()

AttributeError: 'numpy.dtype[object_]' object has no attribute 'value_counts'

In [43]:
s_names.value_counts()

unavailable                 19
Cacatua tenuirostris         9
Colobus guerza               9
Bassariscus astutus          8
Uraeginthus angolensis       7
                            ..
Eurocephalus anguitimens     1
Carduelis uropygialis        1
Galago crassicaudataus       1
Eutamias minimus             1
Cochlearius cochlearius      1
Name: scientific_name, Length: 449, dtype: int64